turbq/atprog/packs/atmel/SAML11_DFP/1.0.109/Atmel.SAML11_DFP.pdsc
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="ATSAML11E15A">
         <description>Headers and startup code for Atmel ATSAML11E15A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_saml11e15a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_saml11e15a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/saml11e15a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/saml11e15a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/SAML11/startup_saml11.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/SAML11/system_saml11e15a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_saml11e15a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_saml11e15a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/atsaml11e15a/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/atsaml11e15a/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="ATSAML11D15A">
         <description>Headers and startup code for Atmel ATSAML11D15A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_saml11d15a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_saml11d15a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/saml11d15a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/saml11d15a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/SAML11/startup_saml11.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/SAML11/system_saml11d15a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_saml11d15a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_saml11d15a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/atsaml11d15a/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/atsaml11d15a/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="ATSAML11D14A">
         <description>Headers and startup code for Atmel ATSAML11D14A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_saml11d14a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_saml11d14a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/saml11d14a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/saml11d14a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/SAML11/startup_saml11.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/SAML11/system_saml11d14a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_saml11d14a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_saml11d14a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/atsaml11d14a/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/atsaml11d14a/flash.icf" attr="config"/>
         </files>
      </component>
   </components>
</package>
